In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['afra','nabila','juhi','niha'],
    "marks":[90,92,91,93]
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks
0    afra     90
1  nabila     92
2    juhi     91
3    niha     93

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_indexfalse.csv',index=False)

In [7]:
df.head(2)

     name  marks
0    afra     90
1  nabila     92

In [8]:
df.tail(2)

   name  marks
2  juhi     91
3  niha     93

In [9]:
df.describe()

           marks
count   4.000000
mean   91.500000
std     1.290994
min    90.000000
25%    90.750000
50%    91.500000
75%    92.250000
max    93.000000

In [10]:
nabila = pd.read_csv('practise.csv')

In [11]:
nabila

     name  marks   City  Unnamed: 3
0    afra     90    CTG         NaN
1  nabila     92  Dhaka         NaN
2    juhi     91    Cox         NaN
3    niha     93    CTG         NaN

In [12]:
nabila['marks']

0    90
1    92
2    91
3    93
Name: marks, dtype: int64

In [13]:
nabila['marks'][0]

90

In [16]:
nabila.index = ['first','second','third','forth']

In [17]:
nabila

          name  marks   City  Unnamed: 3
first     afra     90    CTG         NaN
second  nabila     92  Dhaka         NaN
third     juhi     91    Cox         NaN
forth     niha     93    CTG         NaN

In [46]:
#condition statement
df[df.marks>=91]

     name  marks
1  nabila     92
2    juhi     91
3    niha     93

In [48]:
df[df.marks==df['marks'].max()]

   name  marks
3  niha     93

In [50]:
df.set_index('name',inplace=True)

In [51]:
df

        marks
name
afra       90
nabila     92
juhi       91
niha       93

In [52]:
df.loc['afra']

marks    90
Name: afra, dtype: int64

In [19]:
ser = pd.Series(np.random.rand(34))

In [20]:
ser

0     0.886068
1     0.126143
2     0.248346
3     0.737447
4     0.813627
5     0.671543
6     0.074151
7     0.221132
8     0.424267
9     0.216556
10    0.248585
11    0.990176
12    0.577725
13    0.819141
14    0.957210
15    0.467437
16    0.017341
17    0.992219
18    0.400457
19    0.620689
20    0.999197
21    0.437139
22    0.526017
23    0.913253
24    0.100885
25    0.883595
26    0.083374
27    0.558581
28    0.866364
29    0.227379
30    0.209589
31    0.926972
32    0.304877
33    0.077604
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [42]:
df[['name','marks']]

     name  marks
0    afra     90
1  nabila     92
2    juhi     91
3    niha     93

In [23]:
newdef=pd.DataFrame(np.random.rand(334,5),index = np.arange(334))

In [24]:
newdef.head()

          0         1         2         3         4
0  0.851177  0.944451  0.523790  0.086499  0.556148
1  0.444443  0.885758  0.090260  0.052291  0.828485
2  0.950823  0.974773  0.472315  0.157832  0.707804
3  0.929569  0.754723  0.845063  0.488623  0.092851
4  0.864225  0.124911  0.271490  0.319305  0.009831

In [25]:
newdef

            0         1         2         3         4
0    0.851177  0.944451  0.523790  0.086499  0.556148
1    0.444443  0.885758  0.090260  0.052291  0.828485
2    0.950823  0.974773  0.472315  0.157832  0.707804
3    0.929569  0.754723  0.845063  0.488623  0.092851
4    0.864225  0.124911  0.271490  0.319305  0.009831
..        ...       ...       ...       ...       ...
329  0.783464  0.576992  0.367832  0.409875  0.204301
330  0.135183  0.633623  0.012337  0.905199  0.703649
331  0.327712  0.658796  0.582393  0.717915  0.682665
332  0.021412  0.509982  0.053749  0.122978  0.273090
333  0.122100  0.166479  0.516526  0.559458  0.943805

[334 rows x 5 columns]

In [26]:
type(newdef)

pandas.core.frame.DataFrame

In [27]:
newdef.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.501207    0.501934    0.472455    0.506795    0.499991
std      0.289230    0.294127    0.287121    0.290380    0.280906
min      0.003197    0.003078    0.002175    0.000844    0.001631
25%      0.254957    0.232795    0.220562    0.280927    0.259238
50%      0.495214    0.505586    0.495322    0.494881    0.486624
75%      0.756778    0.753899    0.704354    0.755350    0.729239
max      0.999367    0.999558    0.995045    0.999217    0.992566

In [28]:
newdef.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [29]:
newdef[0][0] = "nabila"

In [30]:
newdef.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
newdef.head()

          0         1         2         3         4
0    nabila  0.944451  0.523790  0.086499  0.556148
1  0.444443  0.885758  0.090260  0.052291  0.828485
2  0.950823  0.974773  0.472315  0.157832  0.707804
3  0.929569  0.754723  0.845063  0.488623  0.092851
4  0.864225  0.124911  0.271490  0.319305  0.009831

In [32]:
newdef.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [33]:
newdef.columns

RangeIndex(start=0, stop=5, step=1)

In [35]:
newdef.to_numpy()

array([['nabila', 0.9444505155503294, 0.5237896119027763,
        0.08649922633522644, 0.5561475525044581],
       [0.44444341296504863, 0.8857575084780102, 0.09025961662811388,
        0.052290955476963275, 0.828485353192619],
       [0.9508234027405889, 0.9747726751597097, 0.47231491460861175,
        0.15783242053520918, 0.7078043601886417],
       ...,
       [0.327711600926905, 0.6587959925138641, 0.5823929742619881,
        0.7179149988583057, 0.6826646241222376],
       [0.021411518127575024, 0.5099821529825489, 0.05374885619716607,
        0.12297840464374998, 0.2730895086387606],
       [0.1221003397308067, 0.16647872810813014, 0.5165262669453258,
        0.5594577331079341, 0.9438052184026188]], dtype=object)

In [36]:
newdef.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,nabila,0.444443,0.950823,0.929569,0.864225,0.55873,0.256726,0.584996,0.75907,0.418464,...,0.105098,0.435122,0.401711,0.764785,0.223443,0.783464,0.135183,0.327712,0.021412,0.1221
1,0.944451,0.885758,0.974773,0.754723,0.124911,0.500009,0.789494,0.327945,0.351401,0.130243,...,0.077786,0.146825,0.409608,0.311141,0.016391,0.576992,0.633623,0.658796,0.509982,0.166479
2,0.52379,0.09026,0.472315,0.845063,0.27149,0.628247,0.477154,0.262025,0.383914,0.300435,...,0.317633,0.221056,0.691396,0.445702,0.073929,0.367832,0.012337,0.582393,0.053749,0.516526
3,0.086499,0.052291,0.157832,0.488623,0.319305,0.562958,0.124722,0.611114,0.825616,0.858979,...,0.028878,0.74076,0.523124,0.901038,0.161927,0.409875,0.905199,0.717915,0.122978,0.559458
4,0.556148,0.828485,0.707804,0.092851,0.009831,0.034458,0.124095,0.740452,0.575833,0.490842,...,0.534537,0.145551,0.848118,0.268102,0.817243,0.204301,0.703649,0.682665,0.27309,0.943805

In [37]:
newdef.head()

          0         1         2         3         4
0    nabila  0.944451  0.523790  0.086499  0.556148
1  0.444443  0.885758  0.090260  0.052291  0.828485
2  0.950823  0.974773  0.472315  0.157832  0.707804
3  0.929569  0.754723  0.845063  0.488623  0.092851
4  0.864225  0.124911  0.271490  0.319305  0.009831

In [38]:
newdef[2:5]

          0         1         2         3         4
2  0.950823  0.974773  0.472315  0.157832  0.707804
3  0.929569  0.754723  0.845063  0.488623  0.092851
4  0.864225  0.124911  0.271490  0.319305  0.009831

In [39]:
rows,columns = newdef.shape

In [40]:
rows

334

In [41]:
columns

5

In [43]:
newdef[1].max() #min,std,mean

0.9995581836666176